// 12.用户定义一个数字，数字的范围在 1-9999之间，
// 然后输入的数字是 3，则前面补全 3个0，使之成为”0003”
// 如果输入的数字是25，则前面补全2个0,  使之成为”0025”
// 如果输入的数字是146，则前面补全1个0，使之成为”0146”
// 如果输入的数字是1235，则不用补全。
// 最后将结果打印出来。


var x =1314
var g,s,b,q;
    g=x%10;                      //个
    s=parseInt(x%100/10);        //十
    b=parseInt(x%1000/100);      //百
    q=parseInt(x%10000/1000);    //千
for(i=1;i<=9999;i++)
{if(g!=0&&s==0&&b==0&&q==0){
    console.log(`000${g}`)
}
else if(g!=0&&s!=0&&b==0&&q==0)  {
    console.log(`00${sg}`)
}
else if (g!=0&&s!=0&&b!=0&&q==0){
    console.log(`0${bsg}`)
}

else{
    console.log('不用补全')
}

}