// 1.行内元素和块级元素的区别是什么？怎么将行内元素转为块级元素？
// 2.行内元素有哪些？块级元素有哪些？行内块元素有哪些？
// 3.块元素有什么特点？行内元素有什么特点？
// 4.css的复合选择器有哪些？举列子说明
// 5.背景的属性有哪些？分别是什么作用？

// 1  行内元素 有span  a    不能设置宽高，   maging和pading 上下都不能设置        宽度会随着文本多少而变化       其他转为块        display: block

// 块级元素 有  h1-h6   div       能 设置宽高   margin  padding           文字类的块元素不能套其他块元素  


// 2      行内元素 有span  a     块级元素 有  h1-h6   div     行内块有    img input 


// 3行内元素 一行显示多个       块级元素  独占一行


// 4 后代选器  空格     子代  选择器>       并集选择器   ,      伪类选择器   : 



// 5 背景颜色 background - color        transparent 完全透明      rgba    a(透明度  0 - 1)       position（像素 移动 ） 