
// 11.商场推出幸运抽奖活动，抽奖规则如下：
// (1)用户输入一个四位数字(1000-9999的数字),作为顾客的会员卡号
// (2)该会员卡号(四位数字)各位数字之和大于20，则为幸运客户
// (3)打印格式：
//    请输入4位会员卡号：3569
//    会员卡号3569各位之和：23
//    会员卡号3569是幸运客户

//    请输入4位会员卡号：1234
//    会员卡号3569各位之和：10
//    会员卡号3569不是幸运客户

var x=3569
var g,s,b,q;
    g=x%10;                      //个
    s=parseInt(x%100/10);        //十
    b=parseInt(x%1000/100);      //百
    q=parseInt(x%10000/1000);    //千
   
    if((g+s+b+q)>20){
        console.log('3569是幸运客户')
    }
 
    var x=1234
var g,s,b,q;
    g=x%10;                      //个
    s=parseInt(x%100/10);        //十
    b=parseInt(x%1000/100);      //百
    q=parseInt(x%10000/1000);    //千
   
    if((g+s+b+q)>20){
        console.log('3569是幸运客户')
    }
 else{
     console.log('3569不是幸运客户')
 }